uhnp/src/Catalogs/АналитическиеПанели/АналитическиеПанели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитическиеПанели</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ПакетыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьЗаголовкиСтраниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазметкаПанели</name>
    <attributes>
      <name>ИмяСтраницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>EnumRef.ВидыЭлементовАналитическойПанели</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиЭлемента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяГруппыЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкрытьЗаголовокЭлемента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбъекта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗафиксироватьОтборы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтраницыПанели</name>
    <attributes>
      <name>ИмяСтраницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексСтраницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Видимость</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветФонаСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеИБ</name>
    <attributes>
      <name>ТипИБ</name>
      <type>
        <types>CatalogRef.ТипыБазДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ВнешниеИнформационныеБазы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/АналитическиеПанели/Forms/ФормаУправленияСтраницами/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	тСтраницы = ПолучитьИзВременногоХранилища(Параметры.АдресСтраницыПанели);
	Для Каждого Стр Из тСтраницы Цикл
		
		нСтраница = СтраницыПанели.Добавить();
		ЗаполнитьЗначенияСвойств(нСтраница,Стр);
		
	КонецЦикла;	
	
	ОтображатьЗаголовкиСтраниц = Параметры.ОтображатьЗаголовкиСтраниц;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьЗаголовкиСтраницПриИзменении(Элемент)
		
	Оповестить("ОтображатьЗаголовкиСтраниц",ОтображатьЗаголовкиСтраниц);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПанелиПередУдалением(Элемент, Отказ)
	
	Если СтраницыПанели.Количество() = 1 Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нельзя удалить единственную страницу'"));		
		Отказ = Истина;
		Возврат;	
	КонецЕсли;	
	
	Если Элемент.ТекущиеДанные.ЕстьЭлементы Тогда	
		Отказ = Истина;
		ВопросУдалитьСтраницу();
	Иначе			
		Оповестить("УдалитьСтраницу",Новый Структура("Страница",Элементы.СтраницыПанели.ТекущиеДанные.ИмяСтраницы));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдалитьСтраницу()
	
	Оповещение = Новый ОписаниеОповещения("УдалитьСтраницу",ЭтаФорма);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Текущая страница будет удалена со всеми элементами, продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницу(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		Оповестить("УдалитьСтраницу",Новый Структура("Страница",Элементы.СтраницыПанели.ТекущиеДанные.ИмяСтраницы));
		СтраницыПанели.Удалить(Элементы.СтраницыПанели.ТекущаяСтрока);		
	КонецЕсли;		
			
КонецПроцедуры



&НаКлиенте
Процедура СтраницыПанелиПриИзменении(Элемент)
	
	Если Элемент.ТекущийЭлемент.Имя = "СтраницыПанелиВидимость" Тогда
		
		Оповестить("ИзменитьВидимостьСтраницы",Новый Структура("Страница,Видимость",Элемент.ТекущиеДанные.ИмяСтраницы,Элемент.ТекущиеДанные.Видимость));
		
		
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СтраницыПанелиЗаголовок" Тогда
	
		Оповестить("ИзменитьЗаголовокСтраницы",Новый Структура("Страница,Заголовок",Элемент.ТекущиеДанные.ИмяСтраницы,Элемент.ТекущиеДанные.Заголовок));
		
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СтраницыПанелиЦветФона" Тогда
	
		Оповестить("ИзменитьЦветФонаСтраницы",Новый Структура("Страница,ЦветФона",Элемент.ТекущиеДанные.ИмяСтраницы,Элемент.ТекущиеДанные.ЦветФона));
			
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьВверх(Команда)
	
	
	ИндексСтраницыВПаенеле = Элементы.СтраницыПанели.ТекущиеДанные.ИндексСтраницы;
	Если ИндексСтраницыВПаенеле = 1 Тогда
		Возврат;
	Иначе	
		Предшественник = СтраницыПанели.НайтиСтроки(Новый Структура("ИндексСтраницы",ИндексСтраницыВПаенеле-1))[0];
	КонецЕсли;	
	
	СтраницыПанели.Сдвинуть((ИндексСтраницыВПаенеле-1),-1);
	
	Предшественник.ИндексСтраницы = ИндексСтраницыВПаенеле;
	Элементы.СтраницыПанели.ТекущиеДанные.ИндексСтраницы = ИндексСтраницыВПаенеле-1; 
	
	Оповестить("СдвинутьСтраницу",Новый Структура("Страница,ПредыдущаяСтраница,Направление",Элементы.СтраницыПанели.ТекущиеДанные.ИмяСтраницы,Предшественник.ИмяСтраницы,-1));

	
КонецПроцедуры   

&НаКлиенте
Процедура СдвинутьВниз(Команда)
	
	
	ИндексСтраницыВПаенеле = Элементы.СтраницыПанели.ТекущиеДанные.ИндексСтраницы;
	Если ИндексСтраницыВПаенеле = СтраницыПанели.Количество() Тогда
		Возврат;
	Иначе	
		Предшественник = СтраницыПанели.НайтиСтроки(Новый Структура("ИндексСтраницы",ИндексСтраницыВПаенеле+1))[0];
	КонецЕсли;	
	
	СтраницыПанели.Сдвинуть((ИндексСтраницыВПаенеле-1),1);
	
	Предшественник.ИндексСтраницы = ИндексСтраницыВПаенеле;
	Элементы.СтраницыПанели.ТекущиеДанные.ИндексСтраницы = ИндексСтраницыВПаенеле+1; 
	
	Если Элементы.СтраницыПанели.ТекущиеДанные.ИндексСтраницы = СтраницыПанели.Количество() Тогда
		Оповестить("СдвинутьСтраницу",Новый Структура("Страница,ПредыдущаяСтраница,Направление",Элементы.СтраницыПанели.ТекущиеДанные.ИмяСтраницы,Неопределено,1));

	Иначе	
		ЭлементДляПозицииРазмещения = СтраницыПанели.НайтиСтроки(Новый Структура("ИндексСтраницы",Элементы.СтраницыПанели.ТекущиеДанные.ИндексСтраницы+1))[0];
		Оповестить("СдвинутьСтраницу",Новый Структура("Страница,ПредыдущаяСтраница,Направление",Элементы.СтраницыПанели.ТекущиеДанные.ИмяСтраницы,ЭлементДляПозицииРазмещения.ИмяСтраницы,1));
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПанелиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	нСтраница 					= СтраницыПанели.Добавить();
	нСтраница.ИндексСтраницы    = СтраницыПанели.Количество();
	нСтраница.ИмяСтраницы    	= "Страница"+(СтраницыПанели.Количество());
    нСтраница.Заголовок    		= Нстр("ru = 'Страница '")+(СтраницыПанели.Количество());
    нСтраница.Видимость         = Истина;
	нСтраница.ЦветФона          = ВернутьЦветПоУмолчанию();
		
	Оповестить("ДобавитьСтраницу",Новый Структура("ИмяСтраницы,Заголовок,ИндексСтраницы"
	,нСтраница.ИмяСтраницы
	,нСтраница.Заголовок
	,нСтраница.ИндексСтраницы));

	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ВернутьЦветПоУмолчанию()
	
	Возврат  ЦветаСтиля.ЦветФонаФормы;
	
КонецФункции

&НаКлиенте
Процедура СтраницыПанелиПриАктивизацииСтроки(Элемент)
		
	Оповестить("ПоказатьСтраницу",Новый Структура("Страница",Элементы.СтраницыПанели.ТекущиеДанные.ИмяСтраницы));
		
КонецПроцедуры
